{
  "Home": "Hafan",
  "Vacancy": "Swydd wag",
  "Eligibility Checker": "Gwiriwr Cymhwysedd",
  "Eligibility Check": "Gwiriad Cymhwysedd",
  "Eligibility Pass": "Pàs Cymhwysedd",
  "Apply": "Gwneud cais",
  "Apply in Welsh": "Gwneud cais yn Gymraeg",
  "Apply for a role task list": "Gwneud cais am restr tasgau rôl",
  "Check if you meet the nationality requirement": "GWIRIWCH a ydych YN bodloni'r gofyniad cenedligrwydd",
  "Citizenship": "Dinasyddiaeth",
  "In order to apply you need to be a citizen of the UK, Republic of Ireland or another Commonwealth country.": "Er mwyn gwneud cais, mae angen i chi fod yn ddinesydd y DU, Gweriniaeth Iwerddon neu un o wledydd eraill y Gymanwlad.",
  "Are you a citizen of the UK, the Republic of Ireland or another Commonwealth country?": "Ydych chi’n ddinesydd y DU, Gweriniaeth Iwerddon neu un o wledydd eraill y Gymanwlad?",
  "Yes": "Ydw",
  "No": "Nac ydw",
  "It looks like you meet the nationality requirement": "Mae’n ymddangos eich bod yn bodloni’r gofyniad cenedligrwydd",
  "Based on your answer, it looks like you meet the nationality requirement for the role, but there may be other eligibility requirements. Please check the information page for each exercise carefully to consider if you meet any additional requirements.": "Ar sail eich ateb, mae’n ymddangos eich bod yn bodloni’r gofynion cenedligrwydd ar gyfer y rôl, ond efallai y bydd gofynion cymhwysedd eraill. Edrychwch ar y dudalen wybodaeth ar gyfer pob ymarfer yn ofalus i ystyried a ydych chi'n bodloni unrhyw ofynion ychwanegol.",
  "Continue": "Parhau",
  "GDPR": "GDPR",
  "GDPR Check": "Gwiriad GDPR",
  "Sharing information": "Rhannu gwybodaeth",
  "We sometimes need to share the personal information we process with the individual themselves and also with other organisations. Where this is necessary we will comply with all aspects of the data protection laws.": "Weithiau, mae angen i ni rannu’r wybodaeth bersonol rydym yn ei phrosesu gyda’r unigolyn ei hun a GYDA sefydliadau eraill. Pan fydd angen gwneud hyn, byddwn yn cydymffurfio â phob agwedd O’R DATA DIOGELU.",
  "The organisations we share some aspects of your personal information with may include:": "DYMA’R sefydliadau y gallwn rannu rhai agweddau O’CH gwybodaeth bersonol â nhw:",
  "The judiciary (for statutory consultation)": "Y farnwriaeth (ar gyfer ymgynghoriad statudol)",
  "Independent assessors (the individuals nominated by you)": "Aseswyr annibynnol (yr unigolion a enwebir gennych)",
  "HMRC (for tax and financial information)": "Cyllid a Thollau EF (ar gyfer gwybodaeth dreth ac ariannol)",
  "ACRO Criminal Records Office (for criminal record checks)": "Swyddfa Cofnodion Troseddol ACRO (ar gyfer archwiliadau cofnodion troseddol)",
  "Professional bodies (including any relevant regulatory bodies) (for conduct verification)": "Cyrff proffesiynol (gan gynnwys unrhyw gyrff rheoleiddio perthnasol) (ar gyfer dilysu ymddygiad)",
  "Judicial Office, HMCTS, the Ministry of Justice and Judicial College (for purposes relating to the appointment of judges)": "Swyddfa Farnwrol, GLlTEF, y Weinyddiaeth Gyfiawnder a’r Coleg Barnwrol (at ddibenion penodi barnwyr)",
  "Welsh Government (for devolved appointments)": "Llywodraeth Cymru (ar gyfer penodiadau datganoledig)",
  "Judicial Appointments and Conduct Ombudsman (only if you make a complaint to them)": "Ombwdsman Penodiadau ac Ymddygiad Barnwrol (dim ond os byddwch yn gwneud cwyn iddynt)",
  "Please confirm you are content that we may share your data in this way": "Cadarnhewch eich bod yn fodlon i ni rannu eich data fel hyn",
  "Agree and continue": "Cytuno a pharhau",
  "There is a problem": "Mae problem",
  "Please enter a value for Citizenship": "Rhowch werth ar gyfer Dinasyddiaeth",
  "Applications": "Ceisiadau",
  "Apply for the role": "Gwneud cais am y rôl",
  "Review application": "Adolygu’r cais",
  "Loading...": "Wrthi'n llwytho...",
  "Something went wrong": "Aeth rhywbeth o’i le",
  "Reload the page and try again": "Ail-lwythwch y dudalen a rhoi cynnig arall arni",
  "Account profile": "Proffil y cyfrif",
  "Personal details": "Manylion personol",
  "DONE": "WEDI GORFFEN",
  "Character information": "Gwybodaeth am eich cymeriad",
  "Equality and diversity": "Cydraddoldeb ac amrywiaeth",
  "Working preferences": "Dewisiadau gwaith",
  "Set part-time working preferences": "Gosod dewisiadau gweithio rhan-amser",
  "Qualifications and Experience": "Cymwysterau a Phrofiad",
  "Relevant qualifications": "Cymwysterau perthnasol",
  "Post-qualification work experience": "Profiad gwaith ar ôl cymhwyso",
  "Judicial experience": "Profiad barnwrol",
  "Gaps in employment": "Bylchau mewn cyflogaeth",
  "Reasonable length of service": "Cyfnod rhesymol o wasanaeth",
  "Assessments": "Asesiadau",
  "Independent assessors' details": "Manylion yr aseswyr annibynnol",
  "Self assessment with competencies": "Hunan-asesiad gyda chymwyseddau",
  "Additional Information": "Gwybodaeth Ychwanegol",
  "Review your application": "Adolygu eich cais",
  "Print or Download this page": "Argraffu neu lawrlwytho’r dudalen hon",
  "Change": "Newid",
  "Send application": "Anfon y cais",
  "Title": "Teitl",
  "First name": "Enw cyntaf",
  "Last name": "Cyfenw",
  "Previous known name(s)": "Enw(au) a ddefnyddiwyd yn flaenorol",
  "Have you ever been known by any other name? For example, life events which may have changed your name such as marriages, divorces, hyphenated names.": "A ydych wedi cael eich adnabod erioed wrth enw arall? Er enghraifft, gallech fod wedi newid eich enw ar ôl priodi, ysgaru, neu gymryd enw â chyplysnod.",
  "Professional name": "Enw proffesiynol",
  "Email address": "Cyfeiriad e-bost",
  "Phone number": "Rhif ffôn",
  "Date of birth": "Dyddiad geni",
  "NI Number": "Rhif Yswiriant Gwladol",
  "Reasonable adjustments": "Addasiadau rhesymol",
  "No information provided": "Dim gwybodaeth wedi’i darparu",
  "Equality and diversity information": "Gwybodaeth am gydraddoldeb ac amrywiaeth",
  "Qualifications": "Cymwysterau",
  "Post-qualification experience": "Profiad ar ôl cymhwyso",
  "Are you a fee-paid or salaried judge?": "Ydych chi’n farnwr sy’n derbyn ffi neu’n farnwr sy’n derbyn cyflog?",
  "No employment gaps declared.": "Dim bylchau mewn cyflogaeth wedi’u nodi.",
  "Can work a reasonable length of service": "Gallu gweithio am gyfnod rhesymol o wasanaeth",
  "Independent assessors": "Aseswyr annibynnol",
  "Assessor Type": "Math o Asesydd",
  "Full name": "Enw llawn",
  "Title or position": "Teitl neu swydd",
  "Email": "E-bost",
  "Uploaded self assessment with competencies": "Hunan-asesiad gyda chymwyseddau wedi'i uwchlwytho",
  "Not yet received": "Heb ei dderbyn eto",
  "How did you hear about the vacancy?": "Sut clywsoch chi am y swydd hon?",
  "We'll use this information to confirm your identity if you contact us or to contact you about your application.": "Byddwn yn defnyddio’r wybodaeth hon i gadarnhau pwy ydych chi os byddwch yn cysylltu â ni neu i gysylltu â chi ynghylch eich cais.",
  "Middle name(s)": "Enw(au) canol",
  "Suffix": "Ôl-ddodiad",
  "Previously known name(s)": "Enw(au) a ddefnyddiwyd yn flaenorol",
  "For international numbers include the country code. For example, ‘+447123456789’.": "Ar gyfer rhifau rhyngwladol, rhowch god y wlad. Er enghraifft, ‘+447123456789’.",
  "For example, 27 3 1964": "Er enghraifft, 27 3 1964",
  "It’s on your National Insurance card, payslip or P60. For example, ‘QQ 12 34 56 C’.": "Mae ar eich cerdyn Yswiriant Gwladol, eich slip cyflog neu eich P60. Er enghraifft, ‘QQ 12 34 56 C’.",
  "Select one. If you have dual citizenship, please select the option most appropriate to you.": "Dewiswch un. Os oes gennych ddinasyddiaeth ddeuol, dewiswch yr opsiwn sydd fwyaf priodol i chi.",
  "UK": "DU",
  "Republic of Ireland": "Gweriniaeth Iwerddon",
  "Another Commonwealth country": "Gwlad arall y Gymanwlad",
  "Other": "Arall",
  "Reasonable Adjustments": "Addasiadau Rhesymol",
  "With reference to our": "Gan gyfeirio at ein",
  "reasonable adjustments policy": "polisi addasiadau rhesymol",
  "do you have a disability or long term health condition that means you need an adjustment during the process?": "a oes gennych chi anabledd neu gyflwr iechyd hirdymor sy’n golygu bod angen addasiad arnoch yn ystod y broses?",
  "Give details here": "Rhowch fanylion yma",
  "Save and continue": "Cadw a pharhau",
  "Back": "Yn ôl",
  "Day": "Diwrnod",
  "Month": "Mis",
  "Year": "Blwyddyn",
  "National Insurance number": "Rhif Yswiriant Gwladol",
  "Character information | Declaration": "Gwybodaeth am eich cymeriad | Datganiad",
  "Character declaration": "Datganiad cymeriad",
  "You must tell us about any character issues that could affect your suitability for this role. Read the": "Rhaid i chi ddweud wrthym am unrhyw faterion cymeriad a allai effeithio ar eich addasrwydd ar gyfer y swydd hon. Darllenwch y",
  "character guidance": "canllawiau cymeriad",
  "for detailed information.": "am wybodaeth fanwl.",
  "In order to be appointed to a role, you must satisfy good character requirements. Refer to the Good Character Guidance to understand the requirements and your responsibilities.": "I gael eich penodi i swydd, rhaid i chi fodloni gofynion cymeriad da. Cyfeiriwch at y Canllawiau Cymeriad Da i ddeall y gofynion a’ch cyfrifoldebau.",
  "The following pages may present some of the details from your last submitted application.": "Mae’n bosibl y bydd y tudalennau canlynol yn cynnwys rhywfaint o’r manylion o’r cais diweddaraf y gwnaethoch ei gyflwyno.",
  "Please check your details are correct and complete the remaining sections of this form.": "Gwnewch yn siŵr bod eich manylion yn gywir a llenwi gweddill adrannau’r ffurflen hon.",
  "If your circumstances change after completing this form, this might impact your ability to meet the good character requirements. Please notify the Selection Exercise Team if this happens.": "Os yw eich amgylchiadau’n newid ar ôl llenwi’r ffurflen hon, gallai hyn effeithio ar eich gallu i fodloni’r gofynion cymeriad da. Rhowch wybod i Dîm yr Ymarfer Dethol os bydd hyn yn digwydd.",
  "You have a continuing duty, throughout the time that your application is being considered, to inform the Judicial Appointments Commission (JAC) of any matters that might affect the acceptability of your application when considered against this guidance.": "Mae gennych ddyletswydd barhaus, drwy gydol y cyfnod y mae eich cais yn cael ei ystyried, i roi gwybod i’r Comisiwn Penodiadau Barnwrol am unrhyw faterion a allai effeithio ar ba mor dderbyniol yw eich cais wrth ei ystyried yn erbyn y canllawiau hyn.",
  "Warning: Failure to declare any matters that come to light from the Commission's check may prejudice the outcome of your application.": "Rhybudd: Os byddwch yn peidio â datgan unrhyw fater a ddaw i’r golwg yn sgil archwiliad y Comisiwn, gall fod yn niweidiol i ganlyniad eich cais.",
  "Start now": "Dechrau nawr",
  "Character information | Criminal offences": "Gwybodaeth am eich cymeriad | Troseddau",
  "Criminal Offences": "Troseddau",
  "1. Have you ever been convicted for a criminal offence? This includes spent convictions.": "1. YDYCH ERIOED wedi eich cael yn euog o drosedd? Mae hyn yn cynnwys euogfarnau wedi'u disbyddu.",
  "Have you ever been cautioned for a criminal offence?": "YDYCH ERIOED wedi cael RHYBUDDIAD am drosedd?",
  "2. Have you ever been cautioned for a criminal offence?": "2. YDYCH ERIOED wedi cael RHYBUDDIAD am drosedd?",
  "Sentence, penalty or fine": "Dedfryd, cosb neu ddirwy",
  "Date of offence": "Dyddiad y trosedd",
  "Details": "Manylion",
  "Please add details of your caution here": "Rhowch fanylion eich rhybudd yma",
  "Add another": "Ychwanegu un arall",
  "Guidance": "Canllawiau",
  "Visit this link to read further guidance for this question:": "Dilynwch y ddolen hon i ddarllen rhagor o ganllawiau ar gyfer y cwestiwn hwn:",
  "Close": "Cau",
  "Remove": "Dileu",
  "Please enter a value for Sentence, penalty or fine": "Rhowch werth ar gyfer Dedfryd, cosb neu ddirwy",
  "Please enter a value for Date of offence": "Rhowch werth ar gyfer Dyddiad y trosedd",
  "Please enter a value for Details": "Rhowch werth ar gyfer Manylion",
  "Please add details of your conviction here": "Rhowch fanylion eich euogfarn yma",
  "Character information | Review": "Gwybodaeth am eich cymeriad | Adolygu",
  "Check your character declaration information": "Gwiriwch eich datganiad gwybodaeth cymeriad",
  "Have you ever been convicted for a criminal offence?": "YDYCH ERIOED wedi eich cael yn euog o drosedd?",
  "Fixed penalty notices, (including motoring)": "Hysbysiadau cosb benodedig, (gan gynnwys moduro)",
  "Have you received a fixed penalty notice in the last 4 years?": "Ydych chi wedi cael hysbysiad cosb benodedig yn ystod y 4 blynedd diwethaf?",
  "Motoring Offences": "Troseddau Moduro",
  "Have you ever been disqualified from driving?": "Ydych chi erioed wedi cael eich gwahardd rhag gyrru?",
  "Were you convicted of any motoring offences in the past 4 years?": "Ydych chi wedi’ch cael yn euog o unrhyw droseddau moduro yn ystod y 4 blynedd diwethaf?",
  "Financial Matters": "Materion Ariannol",
  "Have you ever been declared bankrupt?": "Ydych chi erioed wedi cael eich datgan yn fethdalwr?",
  "Have you ever entered into an Individual Voluntary Agreement (IVA)?": "Ydych chi erioed wedi ymrwymo i Gytundeb Gwirfoddol Unigol (IVA)?",
  "Have you ever filed late tax returns?": "Ydych chi erioed wedi ffeilio ffurflenni treth yn hwyr?",
  "Have you ever filed late VAT returns?": "Ydych chi erioed wedi ffeilio ffurflenni TAW yn hwyr?",
  "Have you ever been fined by HMRC?": "Ydych chi erioed wedi cael dirwy gan CThEF?",
  "Professional Conduct": "Ymddygiad Proffesiynol",
  "Have you ever been, or are you currently, subject of an allegation or claim of professional misconduct?": "Ydych chi erioed wedi bod, neu ydych chi ar hyn o bryd, yn destun honiad o gamymddwyn proffesiynol?",
  "Have you ever been, or are you currently, subject of an allegation or claim of negligence?": "Ydych chi erioed wedi bod, neu ydych chi ar hyn o bryd, yn destun honiad o esgeulustod?",
  "Have you ever been, or are you currently, subject of an allegation or claim of wrongful dismissal?": "Ydych chi erioed wedi bod, neu ydych chi ar hyn o bryd, yn destun honiad o ddiswyddo ar gam?",
  "Have you ever been, or are you currently, subject of an allegation or claim of discrimination proceedings?": "Ydych chi erioed wedi bod, neu ydych chi ar hyn o bryd, yn destun honiad o wahaniaethu?",
  "Have you ever been, or are you currently, subject of an allegation or claim of harassment proceedings?": "Ydych chi erioed wedi bod, neu ydych chi ar hyn o bryd, yn destun honiad o aflonyddu?",
  "Have you ever been, or are you currently, subject of complaints or disciplinary action?": "Ydych chi erioed wedi bod, neu ydych chi ar hyn o bryd, yn destun cwyn neu gamau disgyblu?",
  "Have you ever been asked to resign from a position?": "Oes rhywun erioed wedi gofyn i chi ymddiswyddo o swydd?",
  "Further Information to be disclosed": "Gwybodaeth Bellach i’w datgelu",
  "Do you have any other issues that you think we should know about when considering your character?": "A OES unrhyw faterion eraill y dylem wybod amdanynt wrth ystyried eich cymeriad?",
  "Save character information declaration": "Cadw datganiad gwybodaeth am eich cymeriad",
  "I understand that it is my continuing duty, throughout the time that my application is being considered, to inform the Judicial Appointments Commission of all relevant matters that might affect the acceptability of my application when considered against this guidance.": "Rwy’n deall bod gennyf ddyletswydd barhaus, drwy gydol y cyfnod y mae fy nghais yn cael ei ystyried, i roi gwybod i’r Comisiwn Penodiadau Barnwrol am yr holl faterion perthnasol a allai effeithio ar ba mor dderbyniol yw fy nghais wrth ei ystyried yn erbyn y canllawiau hyn.",
  "I understand that failure to declare on the application form relevant information which later comes to light is likely to rule out further consideration of my application.": "Rwy’n deall y bydd methu â datgan ar y ffurflen gais wybodaeth berthnasol a ddaw i’r golwg yn nes ymlaen yn golygu na fydd fy nghais yn cael ei ystyried ymhellach.",
  "I understand that failure to disclose information additional to that included on my application form, upon the request of the JAC and to the timetable requested by the JAC, may also rule out further consideration of my application.": "Rwy’n deall y gall peidio â datgelu gwybodaeth sy’n ychwanegol i’r wybodaeth a ddarparwyd ar fy ffurflen gais, ar gais y Comisiwn Penodiadau Barnwrol ac ar yr amser y mae’r Comisiwn Penodiadau Barnwrol yn gofyn amdani, hefyd atal fy nghais rhag cael ei ystyried ymhellach.",
  "Please note that you can edit or update this character declaration information up until your final application submission.": "Cofiwch y gallwch olygu neu ddiweddaru’r wybodaeth yn y datganiad cymeriad hwn nes y byddwch wedi cyflwyno eich cais yn derfynol.",
  "Character information | Fixed penalty notices": "Gwybodaeth am eich cymeriad |  Hysbysiadau cosb benodedig",
  "Fixed Penalty Notices": "Hysbysiadau Cosb Benodedig",
  "3. Have you received a fixed penalty notice in the last 4 years?": "3. Ydych chi wedi cael hysbysiad cosb benodedig yn ystod y 4 blynedd diwethaf?",
  "Penalty or fine": "Cosb neu ddirwy",
  "Please enter a value for Penalty or fine": "Rhowch werth ar gyfer Cosb neu ddirwy",
  "Character information | Motoring offences": "Gwybodaeth am eich cymeriad | Troseddau moduro",
  "4. Have you ever been disqualified from driving?": "4. Ydych chi erioed wedi cael eich gwahardd rhag gyrru?",
  "Sentence, penalty, number of penalty points or fine": "Dedfryd, cosb, nifer y pwyntiau cosb neu ddirwy",
  "Please add details of your disqualification here including the dates of your disqualification period": "Rhowch fanylion eich gwaharddiad yma, gan gynnwys dyddiadau cyfnod eich gwaharddiad",
  "5. Were you convicted of any motoring offences in the past 4 years?": "5. Ydych chi wedi’ch cael yn euog o unrhyw droseddau moduro yn ystod y 4 blynedd diwethaf?",
  "Please add details of your motoring conviction here": "Rhowch fanylion eich euogfarn moduro yma",
  "Please enter a value for Sentence, penalty, number of penalty points or fine": "Rhowch werth ar gyfer Dedfryd, cosb, nifer y pwyntiau cosb neu ddirwy",
  "Character information | Financial matters": "Gwybodaeth am eich cymeriad | Materion ariannol",
  "6. Have you ever been declared bankrupt?": "6. Ydych chi erioed wedi cael eich datgan yn fethdalwr?",
  "Financial year": "Blwyddyn ariannol",
  "e.g. 2021\/2022": "e.e. 2021\/2022",
  "Date of declaration of bankruptcy": "Dyddiad y datganiad methdaliad",
  "Please add details of your bankruptcy here": "Rhowch fanylion eich methdaliad yma",
  "7. Have you ever entered into an Individual Voluntary Agreement (IVA)?": "7. Ydych chi erioed wedi ymrwymo i Gytundeb Gwirfoddol Unigol (IVA)?",
  "Date of IVA": "Dyddiad yr IVA",
  "Please add details of your IVA here": "Rhowch fanylion eich IVA yma",
  "8. Have you ever filed late tax returns?": "8. Ydych chi erioed wedi ffeilio ffurflenni treth yn hwyr?",
  "Date of late tax return": "Dyddiad y ffurflen dreth hwyr",
  "Please add details of your late tax return and provide details of any penalties or surcharges applied. Please write one declaration per financial year, this includes any penalties against you or company or firm that you have personal responsibility for": "Rhowch fanylion eich ffurflen dreth hwyr a manylion unrhyw gosbau neu ordaliadau a roddwyd. Ysgrifennwch un datganiad fesul blwyddyn ariannol, mae hyn yn cynnwys unrhyw gosbau yn eich erbyn chi neu’r cwmni y mae gennych gyfrifoldeb personol drosto",
  "9. Have you ever filed late VAT returns?": "9. Ydych chi erioed wedi ffeilio ffurflenni TAW yn hwyr?",
  "Date of late VAT return": "Dyddiad y ffurflen TAW hwyr",
  "Please add details of your late VAT return and provide details of any penalties or surcharges applied. Please write one declaration per financial year, this includes any penalties against you or company or firm that you have personal responsibility for": "Rhowch fanylion eich ffurflen TAW hwyr a manylion unrhyw gosbau neu ordaliadau a roddwyd. Ysgrifennwch un datganiad fesul blwyddyn ariannol, mae hyn yn cynnwys unrhyw gosbau yn eich erbyn chi neu’r cwmni y mae gennych gyfrifoldeb personol drosto",
  "10. Have you ever been fined by HMRC?": "10. Ydych chi erioed wedi cael dirwy gan CThEF?",
  "Date of incident": "Dyddiad y digwyddiad",
  "Please add details of the incident and provide details of any penalties or surcharges applied. Please write one declaration per financial year, this includes any penalties against you or company or firm that you have personal responsibility for": "Rhowch fanylion y digwyddiad a rhoi manylion unrhyw gosbau neu ordaliadau a roddwyd. Ysgrifennwch un datganiad fesul blwyddyn ariannol, mae hyn yn cynnwys unrhyw gosbau yn eich erbyn chi neu’r cwmni y mae gennych gyfrifoldeb personol drosto",
  "Please fill in Financial year e.g. 2021\/2022": "Llenwch y flwyddyn ariannol e.e. 2021\/2022",
  "Please enter a value for Date of late tax return": "Rhowch werth ar gyfer Dyddiad y ffurflen dreth hwyr",
  "Please enter a value for Date of declaration of bankruptcy": "Rhowch werth ar gyfer Dyddiad y datganiad methdaliad",
  "Please enter a value for Date of IVA": "Rhowch werth ar gyfer Dyddiad yr IVA",
  "Please enter a value for Date of late VAT return": "Rhowch werth ar gyfer Dyddiad y ffurflen TAW hwyr",
  "Please enter a value for Date of incident": "Rhowch werth ar gyfer Dyddiad y digwyddiad",
  "Character information | Professional conduct": "Gwybodaeth am eich cymeriad | Ymddygiad proffesiynol",
  "11. Have you ever been, or are you currently, subject of an allegation or claim of professional misconduct?": "11. Ydych chi erioed wedi bod, neu a ydych chi ar hyn o bryd, yn destun honiad o gamymddwyn proffesiynol?",
  "Is the investigation ongoing?": "A yw’r ymchwiliad yn dal i fynd rhagddo?",
  "Please add details of your professional misconduct here": "Rhowch fanylion eich camymddwyn proffesiynol yma",
  "Date": "Dyddiad",
  "Please enter a value for Date": "Rhowch werth ar gyfer y Dyddiad",
  "Please enter a value for Is the investigation ongoing?": "Rhowch werth ar gyfer A yw’r ymchwiliad yn dal i fynd rhagddo?",
  "12. Have you ever been, or are you currently, subject of an allegation or claim of negligence?": "12. Ydych chi erioed wedi bod, neu a ydych chi ar hyn o bryd, yn destun honiad o esgeulustod?",
  "Please add details of your negligence here": "Rhowch fanylion eich esgeulustod yma",
  "13. Have you ever been, or are you currently, subject of an allegation or claim of wrongful dismissal?": "13. Ydych chi erioed wedi bod, neu a ydych chi ar hyn o bryd, yn destun honiad o ddiswyddo ar gam?",
  "Please add details of your wrongful dismissal here": "Rhowch fanylion am y diswyddo ar gam yma",
  "14. Have you ever been, or are you currently, subject of an allegation or claim of discrimination proceedings?": "14. Ydych chi erioed wedi bod, neu a ydych chi ar hyn o bryd, yn destun honiad o wahaniaethu?",
  "Please add details of your discrimination proceeding here": "Rhowch fanylion yr achos o wahaniaethu yma",
  "15. Have you ever been, or are you currently, subject of an allegation or claim of harassment proceedings?": "15. Ydych chi erioed wedi bod, neu a ydych chi ar hyn o bryd, yn destun honiad o aflonyddu?",
  "Please add details of your harassment proceeding here": "Rhowch fanylion yr achos o aflonyddu yma",
  "16. Have you ever been, or are you currently, subject of complaints or disciplinary action?": "16. Ydych chi erioed wedi bod, neu a ydych chi ar hyn o bryd, yn destun cwyn neu gamau disgyblu?",
  "Please add details of your complaint or disciplinary action here": "Rhowch fanylion eich cwyn neu'r camau disgyblu yma",
  "17. Have you ever been asked to resign from a position?": "17. A oes rhywun erioed wedi gofyn i chi ymddiswyddo o swydd?",
  "Please add details here": "Rhowch fanylion yma",
  "Character information | Further information": "Gwybodaeth am gymeriad | Rhagor o wybodaeth",
  "18. Do you have any other issues that you think we should know about when considering your character?": "18. A OES unrhyw faterion eraill y dylem wybod amdanynt wrth ystyried eich cymeriad?",
  "Please add details of any other issues here": "Rhowch fanylion unrhyw faterion eraill yma",
  "Please check all boxes to continue": "Gwiriwch pob blwch i barhau",
  "Take the equality and diversity survey": "Llenwi’r arolwg cydraddoldeb ac amrywiaeth",
  "The JAC is committed to equality and diversity and monitors selection processes to ensure that they are fair. If you do not want to disclose your diversity data in any given area, please select ‘Prefer not to say’ for the relevant question.": "Mae’r Comisiwn wedi ymrwymo i gydraddoldeb ac amrywiaeth ac mae’n monitro prosesau dethol i sicrhau eu bod yn deg. Os nad ydych chi eisiau datgelu eich data amrywiaeth mewn unrhyw faes penodol, dewiswch ‘Mae’n well gen i beidio dweud’ ar gyfer y cwestiwn perthnasol.",
  "The JAC will use the information you provide in two ways: where the": "Bydd y Comisiwn yn defnyddio’r wybodaeth y byddwch yn ei rhannu mewn dwy ffordd: pan fydd y",
  "Equal Merit approach": "dull Teilyngdod Cyfartal",
  "applies, and to monitor the selection process. Other than for the purposes of Equal Merit, your diversity monitoring information will not play any part in the selection process.": "yn berthnasol, ac i fonitro’r broses ddethol. Ac eithrio at ddibenion Teilyngdod Cyfartal, ni fydd eich gwybodaeth monitro amrywiaeth yn chwarae unrhyw ran yn y broses ddethol.",
  "The JAC may also use the information you provided for the purpose of “": "Efallai y bydd y Comisiwn hefyd yn defnyddio’r wybodaeth rydych wedi'i nodi at ddibenion “",
  "Outreach": "Allgymorth",
  "”, to support our statutory duty to encourage diversity in the pool of applicants for judicial appointment.": "“, i gefnogi ein dyletswydd statudol i annog amrywiaeth yn y gronfa ymgeiswyr am benodiad barnwrol.",
  "If you are recommended for an appointment we will also share your information with the Ministry of Justice, Judicial Office and His Majesty's Courts and Tribunal Service.": "Os cewch eich argymell ar gyfer penodiad, byddwn hefyd yn rhannu eich gwybodaeth â’r Weinyddiaeth Gyfiawnder, y Swyddfa Farnwrol a Gwasanaeth Llysoedd a Thribiwnlysoedd Ei Fawrhydi.",
  "You can opt out if you do not wish to share your data with MoJ, HMCTS, and Judicial Office.": "Gallwch optio allan os nad ydych chi’n dymuno rhannu eich data â’r Weinyddiaeth Gyfiawnder, Gwasanaeth Llysoedd a Thribiwnlysoedd Ei Fawrhydi, a’r Swyddfa Farnwrol.",
  "Share": "Rhannu",
  "Do not share": "Peidio â rhannu",
  "What is your professional background?": "Beth yw eich cefndir proffesiynol?",
  "Please enter a value for What is your professional background?": "Rhowch werth ar gyfer Beth yw eich cefndir proffesiynol?",
  "Select all that apply.": "Dewis bob un sy'n berthnasol.",
  "Barrister": "Bargyfreithiwr",
  "Fellow of the Chartered Institute of Legal Executives (CILEx)": "Cymrawd Sefydliad Siartredig y Gweithredwyr Cyfreithiol (CILEx)",
  "Solicitor": "Cyfreithiwr",
  "Other role": "Rôl arall",
  "Prefer not to say": "Mae’n well gen i beidio dweud",
  "What is your current legal role?": "Beth yw eich swydd gyfreithiol bresennol?",
  "Academic": "Academydd",
  "Fee-paid court judge": "Barnwr llys sy’n derbyn ffi",
  "Fee-paid tribunal judge": "Barnwr tribiwnlys sy’n derbyn ffi",
  "Other fee-paid judicial office holder": "Deiliad swydd farnwrol arall sy’n derbyn ffi",
  "Other fee-paid Judicial Office holder role": "Rôl deiliad swydd farnwrol arall sy’n derbyn ffi",
  "Salaried court judge": "Barnwr llys sy’n derbyn cyflog",
  "Salaried tribunal judge": "Barnwr tribiwnlys sy’n derbyn cyflog",
  "Other salaried Judicial Office holder": "Deiliad swydd farnwrol arall sy'n derbyn cyflog",
  "Other salaried Judicial Office holder role": "Rôl deiliad swydd farnwrol arall sy'n derbyn cyflog",
  "Current legal role": "Rôl gyfreithiol bresennol",
  "Do you hold, or have you ever held in the past, a fee-paid judicial role?": "Ydych chi mewn swydd farnwrol sy’n derbyn ffi ar hyn o bryd neu wedi bod mewn un yn y gorffennol?",
  "I have not previously held a fee-paid role": "Nid wyf wedi bod mewn rôl sy'n derbyn ffi o'r blaen",
  "Fee-paid court post": "Swydd mewn llys sy’n derbyn ffi",
  "Fee-paid tribunal post": "Swydd mewn tribiwnlys sy’n derbyn ffi",
  "Other fee-paid Judicial Office": "Deiliad Swydd Farnwrol arall sy’n derbyn ffi",
  "Other fee-paid Judicial Office role": "Rôl deiliad Swydd Farnwrol arall sy’n derbyn ffi",
  "Between the ages 11 to 18, did you mainly go to a state or fee-paying school?": "Rhwng 11 ac 18 oed, aethoch chi i ysgol y wladwriaeth neu ysgol talu ffi yn bennaf?",
  "UK state school - selective": "ysgol y wladwriaeth yn y DU – dethol",
  "UK state school - non-selective": "ysgol y wladwriaeth yn y DU – annetholus",
  "UK independent or fee-paying school": "ysgol annibynnol neu ysgol talu ffi yn y DU",
  "UK independent or fee-paying school with financial assistance (bursary or means-tested scholarship)": "ysgol annibynnol neu ysgol talu ffi yn y DU gyda chymorth ariannol (bwrsari neu ysgoloriaeth sy’n seiliedig ar brawf modd)",
  "I did not go to school in the UK": "heb fynd i’r ysgol yn y DU",
  "Did you go to either Oxford or Cambridge universities?": "Aethoch chi i brifysgol Rhydychen neu Gaergrawnt?",
  "Were you the first generation in your family to go to university?": "Ai chi oedd cenhedlaeth gyntaf eich teulu i fynd i brifysgol?",
  "I did not go to university": "heb fynd i’r brifysgol",
  "What is your ethnic group?": "Beth yw eich grŵp ethnig?",
  "Asian\/Asian British": "Asiaidd\/Asiaidd Prydeinig",
  "Bangladeshi": "Bangladeshaidd",
  "Chinese": "Tsieineaidd",
  "Indian": "Indiaidd",
  "Pakistani": "Pacistanaidd",
  "Any other Asian background": "Unrhyw gefndir Asiaidd arall",
  "Other Asian background": "Cefndir Asiaidd arall",
  "Black\/African\/Caribbean\/Black British": "Du\/Affricanaidd\/Caribïaidd\/Du Prydeinig",
  "African": "Affricanaidd",
  "Caribbean": "Caribïaidd",
  "Any other Black\/African\/Caribbean background": "Unrhyw gefndir Du \/ Affricanaidd \/ Caribïaidd arall",
  "White": "Gwyn",
  "English, Welsh, Scottish, Northern Ireland, British": "Cymreig, Seisnig, Albanaidd, Gogledd Iwerddon, Prydeinig",
  "Irish": "Gwyddelig",
  "Gypsy or Irish Traveller": "Sipsi neu Deithiwr Gwyddelig",
  "Any other White background": "Unrhyw gefndir Gwyn arall",
  "Other White background": "Cefndir Gwyn arall",
  "Mixed or multiple ethnic backgrounds": "Cefndir cymysg neu aml-ethnig",
  "White and Black Caribbean": "Gwyn a Du Caribïaidd",
  "White and Black African": "Gwyn a Du Affricanaidd",
  "White and Asian": "Gwyn ac Asiaidd",
  "Any other mixed or multiple ethnic backgrounds": "Unrhyw gefndir ethnig cymysg neu gyfuniad arall",
  "Other mixed or multiple ethnic backgrounds": "Cefndir ethnig cymysg neu gyfuniad arall",
  "Other ethnic group": "Grŵp ethnig arall",
  "Other ethnic background": "Cefndir ethnig arall",
  "What is your sex?": "Beth yw eich rhyw?",
  "Female": "Benyw",
  "Male": "Gwryw",
  "Gender neutral": "Niwtral o ran rhywedd",
  "Other sex": "Rhyw arall",
  "Is the gender you identify with the same as your sex registered at birth?": "A YW’R rhywedd rydych chi’n uniaethu ag ef yr un fath â’r rhywedd a gofrestrwyd adeg eich geni?",
  "This is about gender re-assignment.": "Mae hyn yn ymwneud ag ailbennu rhywedd.",
  "Please enter your gender identity": "Nodwch eich hunaniaeth rhywedd",
  "How would you describe your sexual orientation?": "Sut byddech chi’n disgrifio eich cyfeiriadedd rhywiol?",
  "Bisexual": "Deurywiol",
  "Gay man": "Dyn hoyw",
  "Gay woman or lesbian": "Menyw hoyw neu lesbiaidd",
  "Heterosexual or straight": "Heterorywiol neu syth",
  "Other sexual orientation": "Cyfeiriadedd rhywiol arall",
  "Do you have a disability?": "A OES gennych chi anabledd?",
  "Disability is defined in the": "Caiff anabledd ei ddiffinio yn",
  "Equality Act 2010.": "Neddf Cydraddoldeb 2010.",
  "Add disability details": "Ychwanegwch fanylion eich anabledd",
  "What is your religion?": "Beth yw eich crefydd?",
  "No religion": "Dim crefydd",
  "Atheist": "Anffyddiwr",
  "Buddhist": "Bwdhydd",
  "Christian": "Cristion",
  "Hindu": "Hindŵ",
  "Jewish": "Iddew",
  "Muslim": "Mwslim",
  "Sikh": "Sikh",
  "Religion or belief": "Crefydd neu gred",
  "Have you attended an outreach event on JAC selection exercises?": "Ydych chi wedi bod mewn digwyddiad allgymorth ar ymarferion dethol y Comisiwn Penodiadau Barnwrol?",
  "Did you participate in a Judicial Workshadowing Scheme?": "A WNAETHOCH chi gymryd rhan mewn Cynllun Cysgodi Gwaith Barnwrol?",
  "Have you taken part in the Pre-Application Judicial Education Programme (PAJE)?": "Ydych chi wedi cymryd rhan yn y Rhaglen Addysg Farnwrol Cyn Ymgeisio (PAJE)?",
  "The": "Mae’r",
  "PAJE scheme": "Cynllun PAJE",
  "helps under-represented groups develop their understanding of the role and skills of judges.": "yn helpu grwpiau sy’n cael eu tangynrychioli i ddatblygu dealltwriaeth o rôl a sgiliau barnwyr.",
  "Yes - online resources and judge-led discussion group course": "DO - adnoddau ar-lein a chwrs grŵp trafod dan arweiniad barnwr",
  "Yes - online resources only": "DO - adnoddau ar-lein yn unig",
  "Part-time working preferences": "Dewisiadau gweithio rhan-amser",
  "Part-time working is available for this role.": "Mae modd gweithio rhan-amser i gyflawni'r rôl hon.",
  "Are you interested in part-time working?": "A oes gennych chi ddiddordeb mewn GWEITHIO’N  rhan-amser?",
  "With reference to the working patterns for this role, provide details of those you want to work.": "gyfeirio at y patrymau gweithio ar gyfer y rôl hon, rhowch fanylion y rhai yr hoffech weithio.",
  "Please enter a value for Are you interested in part-time working?": "Rhowch werth ar gyfer A oes gennych chi ddiddordeb mewn GWEITHIO’N rhan-amser?",
  "Please enter a value for With reference to the working patterns for this role, provide details of those you want to work.": "Rhowch werth ar gyfer Gan gyfeirio at y patrymau gweithio ar gyfer y rôl hon, rhowch fanylion y rhai yr hoffech weithio.",
  "What are you qualified as?": "Ar gyfer pa swydd ydych chi wedi cymhwyso?",
  "Choose 1 option.": "Dewiswch un opsiwn.",
  "Advocate - Scotland": "Eiriolwr - Yr Alban",
  "Where are you qualified?": "Ym mhle ydych chi’n gymwys?",
  "England and Wales": "Cymru a Lloegr",
  "Northern Ireland": "Gogledd Iwerddon",
  "Scotland": "Yr Alban",
  "When did you qualify?": "Pryd wnaethoch chi gymhwyso?",
  "When were you called to the Bar?": "Pryd gawsoch chi eich galw i'r Bar?",
  "Have you completed pupillage?": "Ydych chi wedi cwblhau disgybledd?",
  "Why you were exempt from pupillage (we may ask for a copy of your exemption or practicing certificate)?": "Pam eich bod wedi’ch eithrio rhag disgybledd (efallai y byddwn yn gofyn am gopi o’ch tystysgrif eithrio neu ymarfer)?",
  "Why you were exempt from pupillage?": "Pam eich bod wedi’ch eithrio rhag disgybledd?",
  "As you did not complete pupillage, please provide a copy of your exemption and or practicing certificate": "Gan na wnaethoch gwblhau tymor prawf, darparwch gopi o’ch esemptiad neu dystysgrif ymarfer",
  "Exemption certificate": "Tystysgrif esemptiad",
  "Practicing certificate": "Tystysgrif ymarfer",
  "Qualified solicitor, qualified lawyer from another jurisdiction, or a legal academic transferred to the Bar": "Cyfreithiwr cymwysedig, cyfreithiwr cymwys o awdurdodaeth arall, neu academydd cyfreithiol a drosglwyddwyd i’r Bar",
  "Called to the Bar prior to 1 January 2002": "Wedi fy ngalw i’r Bar cyn 1 Ionawr 2002",
  "Other - Please detail why you were exempt from undertaking pupillage by the Bar Standards Board": "Arall – Nodwch pam eich bod wedi’ch eithrio rhag cyflawni disgybledd gan Fwrdd Safonau’r Bar",
  "Please provide details how you satisfy the ‘judicial-appointment eligibility condition’, set out in section 50 of the Tribunals, Courts and Enforcement Act 2007": "Rhowch fanylion sut yr ydych yn bodloni’r ‘amod cymhwysedd penodiad barnwrol’, a nodir yn adran 50 Deddf Tribiwnlysoedd, Llysoedd a Gorfodaeth 2007",
  "Please enter a value for": "Rhowch werth ar gyfer",
  "Please enter a value for When were you called to the Bar?": "Rhowch werth ar gyfer Pryd gawsoch chi eich galw i’r Bar?",
  "Please enter a value for Have you completed pupillage?": "Rhowch werth ar gyfer Ydych chi wedi cwblhau disgybledd?",
  "Provide details of your career to date including any judicial appointments or quasi-judicial appointments": "Rhowch fanylion eich gyrfa hyd yma gan gynnwys unrhyw benodiadau barnwrol neu benodiadau lled-farnwrol",
  "Job title": "Teitl swydd",
  "Please enter a value for Job title": "Rhowch werth ar gyfer Teitl swydd",
  "Organisation or business name": "Enw’r sefydliad neu’r busnes",
  "Please enter a value for Organisation or business name": "Rhowch werth ar gyfer Enw’r Sefydliad neu’r busnes",
  "Start date": "Dyddiad cychwyn",
  "Please enter a value for Start date": "Rhowch werth ar gyfer y Dyddiad cychwyn",
  "End date": "Dyddiad gorffen",
  "Please enter a value for End date": "Rhowch werth ar gyfer y Dyddiad gorffen",
  "Leave this blank if you're currently in this role.": "Gadewch hwn yn wag os ydych chi yn y swydd hon ar hyn o bryd.",
  "Law-related tasks in this role": "Tasgau sy’n ymwneud â’r gyfraith yn y swydd hon",
  "Please enter a value for Law-related tasks in this role": "Rhowch werth ar gyfer y Tasgau sy’n ymwneud â’r gyfraith yn y swydd hon",
  "Select at least one task you do in this role": "Dewiswch o leiaf un dasg rydych chi’n ei gwneud yn y swydd hon",
  "Select all tasks you do in this role. These are defined in the": "Dewiswch bob tasg rydych chi’n ei gwneud yn y swydd hon. Mae’r rhain wedi’u diffinio yn",
  "Tribunals, Courts and Enforcement Act 2007.": "Neddf Tribiwnlysoedd, Llysoedd a Gorfodaeth 2007.",
  "The carrying-out of judicial functions of any court or tribunal": "Cyflawni swyddogaethau barnwrol mewn unrhyw lys neu dribiwnlys",
  "Acting as an arbitrator": "Gweithredu fel cyflafareddwr",
  "Practice or employment as a lawyer": "Ymarfer neu waith fel cyfreithiwr",
  "Advising on the application of the law": "Rhoi cyngor ar gymhwyso’r gyfraith",
  "Assisting persons involved in proceedings for the resolution of issues arising under the law": "Cynorthwyo unigolion sy’n gysylltiedig ag achosion i ddatrys materion sy’n codi o dan y gyfraith",
  "Acting as mediator in connection with attempts to resolve issues that are, or if not resolved could be, the subject of proceedings": "Gweithredu fel cyfryngwr mewn cysylltiad ag ymgais i benderfynu ar faterion sy’n destun achos, neu a allai fod yn destun achos os na chânt eu penderfynu",
  "Drafting documents intended to affect persons' rights or obligations": "Drafftio dogfennau y bwriedir iddynt effeithio ar hawliau neu rwymedigaethau pobl",
  "Teaching or researching law": "Dysgu neu ymchwilio i’r gyfraith",
  "None of the above - Any activity that, in the relevant decision-maker's opinion, is of a broadly similar nature to those listed above": "Dim un o’r uchod - Unrhyw weithgaredd sydd, ym marn y sawl sy’n gwneud y penderfyniad perthnasol, o natur gyffredinol debyg i weithgaredd sydd wedi’i nodi yn y rhestr uchod",
  "List your different law-related tasks": "Rhestrwch eich tasgau gwahanol sy’n ymwneud â’r gyfraith",
  "Base location and\/or region where you predominately operate\/d": "Lleoliad y swydd a\/neu’r rhanbarth lle rydych chi’n gweithio\/wedi gweithio ynddynt yn bennaf",
  "Please enter a value for Base location and\/or region where you predominately operate\/d": "Rhowch werth ar gyfer Lleoliad y swydd a\/neu’r rhanbarth lle rydych chi’n gweithio\/wedi gweithio ynddynt yn bennaf",
  "Please provide the town\/city, court\/tribunal building, and\/or circuit or region as appropriate.": "Rhowch y dref\/dinas, adeilad y llys\/tribiwnlys, a\/neu’r gylchdaith neu’r rhanbarth fel y bo’n briodol.",
  "Jurisdiction\/area of law": "Awdurdodaeth\/maes y gyfraith",
  "e.g. family (public and\/or private), crime, commercial, technology and construction etc.": "e.e. teulu (cyhoeddus a\/neu breifat), troseddol, masnachol, technoleg ac adeiladu ayb.",
  "Please enter a value for Jurisdiction\/area of law": "Rhowch werth ar gyfer Awdurdodaeth\/maes y gyfraith",
  "Working Basis": "Sail Gweithio",
  "Please enter a value for Working Basis": "Rhowch werth ar gyfer Sail Gweithio",
  "Full-time": "Llawn amser",
  "Salaried part-time": "Rhan amser ar gyflog",
  "Fee paid": "Yn derbyn ffi",
  "We need to understand how you have gained your judicial experience and how many sitting days you have. Expand on the information you've provided about your career.": "Mae angen i ni ddeall sut rydych wedi ennill eich profiad barnwrol a faint o ddiwrnodau eistedd sydd gennych. Soniwch fwy am yr wybodaeth rydych chi wedi’i rhoi am eich gyrfa.",
  "Please enter a value for Are you a fee-paid or salaried judge?": "Rhowch werth ar gyfer Ydych chi’n farnwr sy’n derbyn ffi neu’n farnwr sy’n derbyn cyflog?",
  "Have you sat for at least 15 days?": "Ydych chi wedi eistedd am o leiaf 15 diwrnod?",
  "Enter the number of sitting days for each judicial appointment you have declared on this form.": "Rhowch nifer y diwrnodau eistedd ar gyfer pob penodiad barnwrol rydych chi wedi’i ddatgan ar y ffurflen hon.",
  "Please enter a value for Enter the number of sitting days for each judicial appointment you have declared on this form.": "Rhowch werth ar gyfer Rhowch nifer y diwrnodau eistedd ar gyfer pob penodiad barnwrol rydych chi wedi’i ddatgan ar y ffurflen hon.",
  "Have you declared an appointment or appointments in a quasi-judicial body in this application?": "Ydych chi wedi datgan penodiad neu benodiadau mewn corff lled-farnwrol yn y cais hwn?",
  "Please enter a value for Have you declared an appointment or appointments in a quasi-judicial body in this application?": "Rhowch werth ar gyfer Ydych chi wedi datgan penodiad neu benodiadau mewn corff lled-farnwrol yn y cais hwn?",
  "More about quasi-judicial bodies": "Mwy o wybodaeth am gyrff lled-farnwrol",
  "Quasi-judicial bodies have powers and procedures similar to those of courts. For example, involve complex matters, determining facts and making decisions.": "Mae gan gyrff lled-farnwrol bwerau a gweithdrefnau tebyg i rai’r llysoedd. Er enghraifft, trafod materion cymhleth, penderfynu ar ffeithiau a gwneud penderfyniadau.",
  "Examples of quasi-judicial bodies include:": "Mae enghreifftiau o gyrff lled-farnwrol yn cynnwys:",
  "Coroner": "Crwner",
  "Parole Board": "Bwrdd Parôl",
  "Chair of a statutory inquiry": "Cadeirydd ymchwiliad statudol",
  "Arbitration": "Cyflafareddu",
  "Disciplinary tribunals": "Tribiwnlysoedd disgyblu",
  "Conduct hearings for professional standard bodies": "Gwrandawiadau ymddygiad ar gyfer cyrff safonau proffesiynol",
  "Have you sat for at least 15 days in one or all of these appointments?": "Ydych chi wedi eistedd am o leiaf 15 diwrnod mewn un neu bob un o’r penodiadau hyn?",
  "Enter the number of sitting days for each of the appointments you have declared on this application, and powers and procedures in the office you hold. Include any further details of whether a legal qualification is required, the nature of your work.": "Rhowch nifer y diwrnodau eistedd ar gyfer pob un o’r penodiadau rydych wedi’u datgan yn y cais hwn, a phwerau a gweithdrefnau yn y swydd a ddelir gennych. Dylech gynnwys unrhyw fanylion pellach ynghylch a oes angen cymhwyster cyfreithiol arnoch, a natur eich gwaith.",
  "Please enter a value for Enter the number of sitting days for each of the appointments you have declared on this application, and powers and procedures in the office you hold. Include any further details of whether a legal qualification is required, the nature of your work.": "Rhowch werth ar gyfer Rhowch nifer y diwrnodau eistedd ar gyfer pob un o’r penodiadau rydych wedi’u datgan yn y cais hwn, a phwerau a gweithdrefnau yn y swydd a ddelir gennych. Dylech gynnwys unrhyw fanylion pellach ynghylch a oes angen cymhwyster cyfreithiol arnoch, a natur eich gwaith.",
  "Provide details of how you have acquired the necessary skills for this role in some other significant way.": "Rhowch fanylion sut rydych chi wedi cael y sgiliau angenrheidiol ar gyfer y swydd hon mewn ffordd arwyddocaol arall.",
  "Employment gaps": "Bylchau mewn cyflogaeth",
  "Add dates and details of any gaps in employment you may have": "Ychwanegwch ddyddiadau a manylion unrhyw fylchau mewn cyflogaeth y gallai fod gennych",
  "Can you work for at least 1 years before reaching the retirement age of 75?": "Ydych chi’n gallu gweithio am o leiaf 1 blwyddyn cyn cyrraedd yr oedran ymddeol o 75?",
  "You can set out here why you think you should still be considered for this role. The JAC will consider it when assessing your eligibility for this role.": "Nodwch yma pam rydych chi’n meddwl y dylech chi gael eich ystyried ar gyfer y swydd hon beth bynnag. Bydd y Comisiwn Penodiadau Barnwrol yn ei ystyried wrth asesu eich cymhwysedd ar gyfer y swydd hon.",
  "Give independent assessors details": "Nodwch fanylion yr aseswyr annibynnol",
  "Sometimes called 'referees', your independent assessors will give us their opinion on your suitability for this role.": "Bydd eich aseswyr annibynnol, a elwir yn 'ganolwyr' weithiau, yn rhoi eu barn i ni am eich addasrwydd ar gyfer y rôl hon.",
  "You should read the": "Dylech ddarllen y",
  "guidance on choosing independent assessors": "canllawiau ar ddewis aseswyr annibynnol",
  "before making your nominations.": "cyn gwneud eich enwebiadau.",
  "Who to choose?": "Pwy i’w ddewis?",
  "It is important that you choose the right assessor.": "Mae’n bwysig eich bod yn dewis yr asesydd cywir.",
  "if you are a salaried judicial office holder, you need 2 judicial assessors": "Os ydych chi'n ddeiliad swydd farnwrol sy'n derbyn cyflog, bydd angen 2 asesydd barnwrol arnoch.",
  "if you are a professional with one or more fee-paid judicial roles, you need one professional and one judicial assessor; the judicial assessor should be the judge who can provide examples most relevant to the role for which you are applying": "os ydych chi’n weithiwr proffesiynol gydag un neu fwy o rolau barnwrol sy’n derbyn ffi, mae angen un asesydd proffesiynol ac un asesydd barnwrol arnoch; dylai’r asesydd barnwrol fod yn farnwr a all ddarparu enghreifftiau sydd fwyaf perthnasol i’r rôl yr ydych yn ymgeisio amdani",
  "if you do not hold judicial office and you are employed, you will usually need 2 professional assessors, or for some exercises you can provide one professional and one personal assessor": "os nad ydych yn dal swydd farnwrol a’ch bod yn gyflogedig, fel arfer bydd angen 2 aseswr proffesiynol arnoch, neu gallwch ddarparu un gweithiwr proffesiynol ac un asesydd personol ar gyfer rhai ymarferion",
  "For": "Ar gyfer",
  "judicial roles": "rolau barnwrol,",
  "ideally you should choose someone from your current employment or who has knowledge of your work in a judicial or professional capacity. If you work or practice independently, you may wish to choose someone (such as a judge) who has seen you practice and can provide good examples of your skills in relation to the required competencies.": "yn ddelfrydol dylech ddewis rhywun o’ch cyflogaeth gyfredol neu rywun sy’n adnabod eich gwaith mewn modd barnwrol neu broffesiynol. Os ydych chi’n gweithio neu’n ymarfer yn annibynnol, efallai yr hoffech ddewis rhywun (fel barnwr) sydd wedi eich gweld yn ymarfer ac sy’n gallu rhoi enghreifftiau da o’ch sgiliau yng nghyswllt y cymwyseddau gofynnol.",
  "professional assessor": "asesydd proffesiynol",
  "could be:": "fod yn:",
  "a senior partner or head of chambers": "Bartner uwch neu bennaeth siambrau",
  "a judicial office holder who can give examples of your professional work": "deiliad swydd farnwrol sy’n gallu rhoi enghreifftiau o’ch gwaith proffesiynol",
  "a client (including a local authority official) or a magistrate": "cleient (gan gynnwys swyddog awdurdod lleol) neu'n ynad",
  "a line manager if you are from a non-legal background; if there is no line manager, then a current or former colleague or client": "rheolwr llinell os ydych chi o gefndir y tu allan i fyd y gyfraith; os nad oes rheolwr llinell, yna cydweithiwr cyfredol, cyn-gydweithiwr neu gyn-gleient",
  "the senior judge of the court, jurisdiction or circuit where you sit most often": "uwch farnwr y llys, yr awdurdodaeth neu'r gylchdaith lle’r ydych chi'n eistedd amlaf",
  "the Senior President or Lord President (Scotland) if you are a Chamber\/Tribunal President": "Uwch Lywydd neu Arglwydd Lywydd (yr Alban) os ydych yn Llywydd Siambr\/Tribiwnlys",
  "the Lord Justice Clerk or Sheriff Principal if you are a Sheriff (Scotland only)": "Clerc yr Arglwydd Ustus neu Bennaeth y Siryf os ydych yn Siryf (yr Alban yn unig)",
  "your appraising judge if you sit on a tribunal": "eich barnwr gwerthuso os ydych yn eistedd ar dribiwnlys",
  "If you are unable to provide one of the above, consider another judge who has first-hand knowledge of your work. If you are unable to provide any judicial assessor, please contact us giving your reasons writing.": "Os nad ydych yn gallu darparu un o’r uchod, ystyriwch farnwr arall sydd â gwybodaeth uniongyrchol am eich gwaith. Os nad ydych yn gallu darparu unrhyw aseswr barnwrol, cysylltwch â ni gan roi eich rhesymau yn ysgrifenedig.",
  "If you are applying for a non-legal role": "rôl nad yw'n gyfreithiol",
  "you should choose assessors who know you well and who can give clear examples of your abilities.": "dylech ddewis aseswyr sy’n eich adnabod yn dda ac sy’n gallu rhoi enghreifftiau clir o’ch galluoedd.",
  "a former colleague, manager or client who is familiar with the way you work": "cyn gydweithiwr, rheolwr neu gleient sy’n gyfarwydd â’r ffordd rydych chi’n gweithio",
  "someone for whom you do voluntary work": "rhywun yr ydych yn gwneud gwaith gwirfoddol iddo",
  "If you have been on maternity leave or a career break, there is no time limit on how recently you have worked with your assessor, although where possible within the last 2 years is recommended so they can provide recent examples.": "Os ydych chi wedi bod ar absenoldeb mamolaeth neu seibiant gyrfa, nid oes terfyn amser o ran pa mor ddiweddar rydych chi wedi gweithio gyda’ch aseswr, ond os yw’n bosibl argymhellir y dylai fod yn ystod y 2 flynedd ddiwethaf, fel eich bod yn gallu darparu enghreifftiau diweddar.",
  "Do not nominate:": "Peidiwch ag enwebu:",
  "another individual who is applying for a role in the same exercise": "unigolyn arall sy’n gwneud cais am rôl yn yr un ymarfer",
  "a JAC commissioner": "Comisiynydd y Comisiwn Penodiadau Barnwrol",
  "a relative (even if you work or have worked with them in a professional capacity)": "perthynas (hyd yn oed os ydych chi’n gweithio neu wedi gweithio gyda nhw mewn rhinwedd broffesiynol)",
  "First independent assessor": "Yr asesydd annibynnol cyntaf",
  "Assessor type": "Math o asesydd",
  "Professional assessor": "Asesydd proffesiynol",
  "Judicial assessor": "Gallai asesydd barnwrol fod yn: (judicial)",
  "Personal assessor": "Gallai asesydd personol fod yn: (personal)",
  "Phone": "Ffôn",
  "Second independent assessor": "Yr ail asesydd annibynnol",
  "Please enter a value for Assessor type": "Rhowch werth ar gyfer Math o asesydd",
  "Please enter a value for Full name": "Rhowch werth ar gyfer Enw llawn",
  "Please enter a value for Title or position": "Rhowch werth ar gyfer Teitl neu swydd",
  "Please enter a value for Email": "Rhowch werth ar gyfer E-bost",
  "Please enter a value for Phone": "Rhowch werth ar gyfer Ffôn",
  "Self-assessment competencies": "Cymwyseddau hunanasesu",
  "Self assessment competencies": "Cymwyseddau hunanasesu",
  "Download the template on this page to complete your self assessment competency statements. It details the specific skills and experience you'll need to demonstrate for this role.": "Lawrlwythwch y templed ar y dudalen hon i lenwi eich datganiadau cymwyseddau hunanasesu. Mae’n nodi manylion y profiad penodol y bydd angen i chi ei ddangos ar gyfer y swydd hon.",
  "Come back to this page to upload your finished statements.": "Dewch yn ôl i’r dudalen hon i uwchlwytho eich datganiadau gorffenedig.",
  "Download self assessment template": "Lawrlwytho templed hunanasesiad",
  "Upload finished self assessment": "Uwchlwytho hunanasesiad gorffenedig",
  "Your file has been received.": "Mae eich ffeil wedi cyrraedd.",
  "Replace": "Disodli",
  "Additional information": "Gwybodaeth ychwanegol",
  "Please tick whichever you feel is appropriate. You can tick more than one box.": "Ticiwch pa un bynnag sy’n briodol yn eich barn chi. Gallwch roi tic mewn mwy nag un blwch.",
  "JAC Website": "Gwefan y Comisiwn Penodiadau Barnwrol",
  "Professional body website or email (eg The Law Society)": "Gwefan neu e-bost corff proffesiynol (ee Cymdeithas y Gyfraith)",
  "Professional body magazine": "Cylchgrawn corff proffesiynol",
  "Judicial Office Extranet": "Allrwyd y Swyddfa Farnwrol",
  "Judging Your Future Newsletter": "Cylchlythyr Judging Your Future",
  "Twitter": "Twitter",
  "LinkedIn": "LinkedIn",
  "Word of mouth": "Clywed gan rywun arall",
  "I prefer not to answer this question": "Mi fyddai'n well gen i beidio ag ateb y cwestiwn hwn",
  "Other form of communication (please specify)": "Math arall o gyfathrebu (rhowch fanylion)",
  "Other form of communication": "Math arall o gyfathrebu",
  "Please enter a value for Other form of communication": "Rhowch werth ar gyfer Math arall o gyfathrebu",
  "Please select at least one option": "Dewiswch o leiaf un opsiwn",
  "Sharing your data:": "Rhannu eich data:",
  "Professional background": "Cefndir proffesiynol",
  "Attended state or fee-paying school": "Wedi mynychu ysgol y wladwriaeth neu ysgol talu ffi",
  "Attended Oxbridge universities": "Wedi mynychu prifysgolion Oxbridge",
  "First generation to go to university": "Y genhedlaeth gyntaf i fynd i’r brifysgol",
  "Sexual orientation": "Cyfeiriadedd rhywiol",
  "Disability": "Anabledd",
  "Attended Outreach events": "Wedi mynychu digwyddiadau allgymorth",
  "Participated in a Judicial Workshadowing Scheme": "Wedi cymryd rhan mewn Cynllun Cysgodi Gwaith Barnwrol",
  "Participated in Pre-application judicial education": "Wedi cymryd rhan mewn addysg farnwrol cyn ymgeisio",
  "Qualification": "Cymhwyster",
  "Location": "Lleoliad",
  "Completed pupillage": "Disgybledd wedi’i chwblhau",
  "Date called to the Bar": "Dyddiad galw i’r Bar",
  "Date completed pupillage": "Dyddiad cwblhau’r ddisgybledd",
  "Organisation or business": "Sefydliad neu fusnes",
  "Dates worked": "Dyddiadau a weithiwyd",
  "Law-related tasks": "Tasgau’n ymwneud â’r gyfraith",
  "Have you sat for at least 15 in one or all of these appointments?": "Ydych chi wedi eistedd am o leiaf 15 diwrnod mewn un neu bob un o’r penodiadau hyn?",
  "details of how you have acquired the necessary skills for this role in some other significant way": "manylion sut rydych chi wedi cael y sgiliau angenrheidiol ar gyfer y swydd hon mewn ffordd arwyddocaol arall",
  "Date of gap": "Dyddiad y bwlch",
  "Confirmation": "Cadarnhad",
  "Application sent": "Cais wedi’i anfon",
  "Your reference number is:": "Eich cyfeirnod yw:",
  "What happens next?": "Beth fydd yn digwydd nesaf?",
  "Thank you for your application. We will be in touch in due course. Please refer to the website for details of this selection exercise and dates of the next stage in the process.": "Diolch am eich cais. Byddwn yn cysylltu â chi maes o law. Edrychwch ar y wefan i gael manylion yr ymarfer dethol hwn a dyddiadau cam nesaf y broses.",
  "You can view your application and apply for other vacancies from your": "Gallwch weld eich cais a gwneud cais am swyddi gwag eraill o’ch",
  "dashboard.": "dangosfwrdd.",
  "Location preferences": "Lleoliad a ffafrir",
  "Jurisdiction preferences": "Dewis awdurdodaeth",
  "Select one answer": "Dewiswch un ateb",
  "Select and rank all that apply. With 1 being your top choice": "Dewiswch bob un sy’n berthnasol a’u rhoi mewn trefn. 1 yw eich dewis gorau",
  "Covering letter": "Llythyr eglurhaol",
  "Covering Letter": "Llythyr Eglurhaol",
  "Please upload your covering letter.": "Uwchlwythwch eich llythyr eglurhaol.",
  "Please upload your covering letter": "Uwchlwythwch eich llythyr eglurhaol",
  "Upload Covering letter": "Uwchlwytho’r llythyr eglurhaol",
  "Curriculum vitae (CV)": "Curriculum vitae (CV)",
  "Upload CV": "Uwchlwytho CV",
  "Statement of suitability": "Datganiad o addasrwydd",
  "Below is a blank template for the statement of suitability. Please save this document, fill it in, then re-upload it to this page.": "Mae templed gwag isod ar gyfer y datganiad o addasrwydd. Cadwch y ddogfen hon, ei llenwi, ac yna ei huwchlwytho eto i’r dudalen hon.",
  "Download Statement Of Suitability template": "Lawrlwytho templed Datganiad Addasrwydd",
  "Upload Statement of Suitability": "Uwchlwytho Datganiad Addasrwydd",
  "Leadership Judge details": "Manylion y Barnwr Arweinyddiaeth",
  "Give Leadership Judge details": "Nodwch fanylion y Barnwr Arweinyddiaeth",
  "Please read the": "Darllenwch y",
  "Information Page": "Dudalen Wybodaeth",
  "for this exercise before completing this section. The Leadership Judge statement of suitability will contribute to your overall assessment alongside the evidence you have provided in your statement of suitability and written work. It should provide evidence that you can demonstrate the skills relevant to the Skills and Abilities for this role. No other references are sought for section 9(1) authorisation, only a statement of suitability from your Leadership Judge.": "ar gyfer yr ymarfer hwn cyn llenwi’r adran hon. Bydd datganiad addasrwydd y Barnwr Arweinyddiaeth yn cyfrannu at eich asesiad cyffredinol ochr yn ochr â’r dystiolaeth a ddarparwyd gennych yn eich datganiad o addasrwydd a’ch gwaith ysgrifenedig. Dylai ddarparu tystiolaeth eich bod yn gallu dangos y sgiliau sy’n berthnasol i’r Sgiliau a’r Galluoedd ar gyfer y swydd hon. Ni ofynnir am unrhyw eirdaon eraill ar gyfer awdurdodi adran 9(1), dim ond datganiad addasrwydd gan eich Barnwr Arweinyddiaeth.",
  "Do not nominate the Lead Judge, the Master of the Rolls, a Head of Division, the Statutory Consultees or the Appropriate Authorities whose names can be found in the": "Peidiwch ag enwebu’r Prif Farnwr, Meistr y Rholiau, Pennaeth Adran, yr Ymgyngoreion Statudol na’r Awdurdodau Priodol y gellir dod o hyd i’w henwau yn y",
  "for this exercise.": "ar gyfer yr ymarfer hwn.",
  "Additional preferences": "Dewisiadau ychwanegol",
  "Additional Preferences": "Dewisiadau Ychwanegol",
  "Additional working preferences": "Dewisiadau gweithio ychwanegol",
  "Social Entitlement Chamber": "Siambr Hawliadau Cymdeithasol",
  "Location preferences - Social Entitlement Chamber": "Y lleoliad fyddai orau gennych – Siambr Hawliau Cymdeithasol",
  "Please rank your preference of location for the Social Entitlement Chamber": "Rhestrwch y lleoliadau fyddai orau gennych mewn trefn ar gyfer y Siambr Hawliau Cymdeithasol",
  "Midlands": "Canolbarth Lloegr",
  "North West": "Gogledd Orllewin Lloegr",
  "North East": "Gogledd Ddwyrain Lloegr",
  "South East": "De Ddwyrain Lloegr",
  "London": "Llundain",
  "Wales and South West": "Cymru a De-orllewin Lloegr",
  "Immigration and Asylum Chamber": "Siambr Mewnfudo a Lloches",
  "Location preferences - Immigration and Asylum Chamber": "Y lleoliad fyddai orau gennych - Siambr Mewnfudo a Lloches",
  "Please rank your preference of location for the Immigration and Asylum Chamber": "Rhestrwch y lleoliadau fyddai orau gennych mewn trefn ar gyfer y Siambr Mewnfudo a Lloches",
  "London - Taylor House, Hatton Cross": "Llundain - Taylor House, Hatton Cross",
  "Wales - Newport": "Cymru - Casnewydd",
  "Birmingham": "Birmingham",
  "Bradford": "Bradford",
  "Manchester": "Manceinion",
  "North Shields": "North Shields",
  "Scotland - Glasgow": "Yr Alban - Glasgow",
  "Northern Ireland - Belfast": "Gogledd Iwerddon - Belffast",
  "Location preferences - Property": "Y lleoliad fyddai orau gennych - Eiddo",
  "Please rank your preference of location for the Property Chamber": "Rhestrwch y lleoliadau fyddai orau gennych mewn trefn ar gyfer y Siambr Eiddo",
  "Northern - Manchester": "Gogledd Lloegr - Manceinion",
  "Cambridge": "Caergrawnt",
  "Eastern - Cambridge": "Dwyrain Lloegr - Caergrawnt",
  "Midlands - Birmingham": "Canolbarth Lloegr - Birmingham",
  "Southern - Chichester": "De Lloegr - Chichester",
  "Location preferences - Health, Education and Social Care": "Y lleoliad fyddai orau gennych - Iechyd, Addysg a Gofal Cymdeithasol",
  "Please rank your preference of location for the Health, Education and Social Care": "Rhestrwch y lleoliadau fyddai orau gennych mewn trefn ar gyfer Iechyd, Addysg a Gofal Cymdeithasol",
  "Leicester": "Caerlŷr",
  "Darlington": "Darlington",
  "Health, Education and Social Care Chamber - Specialist Post": "Siambr Iechyd, Addysg a Gofal Cymdeithasol - Swydd arbenigol",
  "Health, Education and Social Care Chamber": "Siambr Iechyd, Addysg a Gofal Cymdeithasol",
  "There are seven specialist vacancies in the Health, Education and Social Care jurisdiction in the Health, Education, and Social Care Chamber. Do you wish to be considered for one of these posts?": "Mae saith swydd wag arbenigol yn yr awdurdodaeth Iechyd, Addysg a Gofal Cymdeithasol yn y Siambr Iechyd, Addysg, a Gofal Cymdeithasol. Ydych chi'n dymuno cael eich ystyried ar gyfer un o'r swyddi hyn?",
  "Property Chamber - Specialist post": "Siambr Eiddo - Swydd Arbenigol",
  "Property Chamber": "Siambr Eiddo",
  "There are seven specialist vacancies in the Property Chamber. Do you wish to be considered for one of these posts?": "Mae saith swydd wag arbenigol yn y Siambr Eiddo. Ydych chi'n dymuno cael eich ystyried ar gyfer un o'r swyddi hyn?",
  "Welsh posts": "Swyddi yng Nghymru",
  "Are you applying for a post in Wales?": "Ydych chi'n gwneud cais am swydd yng Nghymru?",
  "Can you speak Welsh?": "Ydych chi'n gallu siarad Cymraeg?",
  "You will be tested on this later in the process.": "Byddwch yn cael prawf yn ddiweddarach yn y broses.",
  "Can you read and write in Welsh?": "Allwch chi ddarllen ac ysgrifennu yn Gymraeg?",
  "Read": "Darllen",
  "Write": "Ysgrifennu",
  "Both": "Y ddau",
  "Are you applying under Schedule 2(d)?": "Ydych chi'n gwneud cais o dan Atodlen 2(d)?",
  "Explain how you've gained experience in law.": "Esboniwch sut rydych chi wedi cael profiad yn y gyfraith.",
  "When did you complete pupillage?": "Pryd wnaethoch chi gwblhau eich tymor prawf?",
  "Voluntary": "Gwirfoddol",
  "Have you sat for at least 30 days?": "Ydych chi wedi eistedd am o leiaf 30 diwrnod?",
  "Have you sat for at least 30 days in one or all of these appointments?": "Ydych chi wedi eistedd am o leiaf 30 diwrnod mewn un o’r swyddi hyn neu’r cwbl ohonynt?",
  "Can you work for at least 5 years before reaching the retirement age of 75?": "Allwch chi weithio am o leiaf 5 mlynedd cyn cyrraedd oed ymddeol, sef 75?",
  "Choose file": "Dewis ffeil",
  "No file chosen": "Dim ffeil wedi'i ddewis",
  "Other professional background": "Cefndir proffesiynol arall",
  "Please rank your choice of chambers. As business requirements may change throughout the exercise for appointment in the First-tier Tribunal, you are required to rank all chambers in order of preference on your application; one being your most preferred choice and four being your least preferred.": "Rhowch eich dewis o siambrau mewn trefn. Gan y gall gofynion busnes newid drwy gydol yr ymarfer i benodi yn y Tribiwnlys Haen Gyntaf, mae'n ofynnol i chi osod pob siambr yn nhrefn eich dewis ar eich cais; un yw’r dewis sydd orau gennych a phedwar yw eich dewis lleiaf ffafriol.",
  "All posts are suitable for SPTW at a minimum of 50%. Job share: An example of this role being shared by two persons could be a 50% split.  The exact working pattern will be agreed between the senior judiciary and the successful candidate at the time of appointment.": "Mae pob swydd yn addas ar gyfer SPTW ar o leiaf 50%. Rhannu swydd: Enghraifft o'r rôl hon yn cael ei rhannu gan ddau unigolyn fyddai 50% yr un. Cytunir ar yr union batrwm gwaith rhwng yr uwch farnwriaeth a'r ymgeisydd llwyddiannus ar yr adeg penodi.",
  "Ranked choice": "Dewis cyntaf",
  "(Ranked choice)": "(Dewis cyntaf)",
  "Single choice": "Un dewis",
  "(Single choice)": "(Un dewis)",
  "Answer not supplied": "Ateb heb ei ddarparu",
  "Are you applying for a Welsh post?": "Ydych chi'n ymgeisio am swydd Gymraeg?",
  "No Law-related tasks provided": "Dim tasgau sy'n gysylltiedig â'r Gyfraith wedi cael eu darparu",
  "January": "Ionawr",
  "February": "Chwefror",
  "March": "Mawrth",
  "April": "Ebrill",
  "May": "Mai",
  "June": "Mehefin",
  "July": "Gorffennaf",
  "August": "Awst",
  "September": "Medi",
  "October": "Hydref",
  "November": "Tachwedd",
  "December": "Rhagfyr",
  "to": "i",
  "Please add details of your fixed penalty notice here": "Ychwanegwch fanylion eich hysbysiad cosb benodedig yma",
  "Other Black\/African\/Caribbean background": "Cefndir Du\/Affricanaidd\/Caribïaidd arall",
  "current": "presennol",
  "Are you interested in posts in Wales?": "A oes gennych chi ddiddordeb mewn swyddi yng Nghymru?",
  "Can you work for at least 4 years before reaching the retirement age of 75?": "Allwch chi weithio am o leiaf 4 blynedd cyn cyrraedd yr oed ymddeol o 75?",
  "Additional Selection Criteria": "Meini Prawf Dethol Ychwanegol",
  "Candidates must be able to demonstrate substantial knowledge and experience of criminal law & procedure. It is expected that candidates’ evidence of knowledge and experience of criminal law & procedure will be within the last 5 years.": "Rhaid i ymgeiswyr allu dangos gwybodaeth a phrofiad sylweddol o’r gyfraith droseddol a gweithdrefnau. Disgwylir y bydd tystiolaeth yr ymgeiswyr o’u gwybodaeth a’u profiad o’r gyfraith droseddol a gweithdrefnau yn perthyn i’r 5 mlynedd diwethaf.",
  "Do you meet this requirement?": "Ydych chi’n bodloni’r gofyniad hwn?",
  "in 250 words tell us how.": "Mewn 250 gair, dywedwch sut.",
  "(optional)": "(dewisol)",
  "Acceptable file types": "Mathau derbyniol o ffeiliau",
  "What was the occupation of your main household earner when you were about aged 14?": "Beth oedd galwedigaeth yr unigolyn a oedd yn ennill mwyaf yn eich cartref pan oeddech oddeutu 14 oed?",
  "Please enter a value for What was the occupation of your main household earner when you were about aged 14?": "Rhowch werth ar gyfer Beth oedd galwedigaeth yr unigolyn a oedd yn ennill mwyaf yn eich cartref pan oeddech oddeutu 14 oed?",
  "Modern professional & traditional professional occupations such as: teacher, nurse, physiotherapist, social worker, musician, police officer (sergeant or above), software designer, accountant, solicitor, medical practitioner, scientist, civil / mechanical engineer.": "Galwedigaethau proffesiynol modern a thraddodiadol megis: athro, nyrs, ffisiotherapydd, gweithiwr cymdeithasol, cerddor, swyddog heddlu (rhingyll neu uwch), dylunydd meddalwedd, cyfrifydd, cyfreithiwr, ymarferydd meddygol, gwyddonydd, peiriannydd sifil / mecanyddol.",
  "Senior, middle or junior managers or administrators such as: finance manager, chief executive, large business owner, office manager, retail manager, bank manager, restaurant manager, warehouse manager.": "Rheolwyr neu weinyddwyr uwch, canol neu iau megis: rheolwr cyllid, prif weithredwr, perchennog busnes mawr, rheolwr swyddfa, rheolwr manwerthu, rheolwr banc, rheolwr bwyty, rheolwr warws.",
  "Clerical and intermediate occupations such as: secretary, personal assistant, call centre agent, clerical worker, nursery nurse.": "Galwedigaethau clercio a chanolradd megis: ysgrifennydd, cynorthwy-ydd personol, asiant canolfan alwadau, gweithiwr clerigol, nyrs feithrin.",
  "Technical and craft occupations such as: motor mechanic, plumber, printer, electrician, gardener, train driver.": "Galwedigaeth technegol a chrefft megis: mecanig cerbydau modur, plymwr, argraffydd, trydanwr, garddwr, gyrrwr trên.",
  "Routine, semi-routine manual and service occupations such as: postal worker, machine operative, security guard, caretaker, farm worker, catering assistant, sales assistant, HGV driver, cleaner, porter, packer, labourer, waiter/waitress, bar staff.": "Galwedigaethau gwasanaeth arferol, lled-arferol neu â llaw megis: gweithiwr post, gweithredydd peirianyddol, gwarchodwr diogelwch, gofalwr, gweithiwr fferm, cynorthwyydd arlwyo, cynorthwyydd gwerthu, gyrrwr HGV, glanhawr, porthor, gweithiwr pacio, llafurwr, gweinydd/gweinyddes, staff bar.",
  "Long-term unemployed (claimed Jobseeker’s Allowance or earlier unemployment benefit for more than a year).": "Di-waith hirdymor (yn hawlio Lwfans Ceisio Gwaith neu fudd-dal diweithdra cynharach ers mwy na blwyddyn).",
  "Small business owners who employed less than 25 people such as: corner shop owners, small plumbing companies, retail shop owner, single restaurant or cafe owner, taxi owner, garage owner.": "Perchnogion busnesau bach a oedd yn cyflogi llai na 25 o bobl megis: perchnogion siopau cornel, cwmnïau plymio bach, perchennog siopau manwerthu, bwyty sengl neu berchennog caffi, perchennog cwmni tacsi, perchennog garej.",
  "Other such as: retired, this question does not apply to me, I don’t know.": "Arall megis: wedi ymddeol, nid yw'r cwestiwn hwn yn berthnasol i mi, nid wyf yn gwybod.",
  "I prefer not to say": "Mae’n well gen i beidio dweud.",
  "Which type of school did you attend for the most time between the ages of 11 and 16?": "Pa fath o ysgol wnaethoch chi fynychu fwyaf rhwng 11 ac 16 oed?",
  "Please enter a value for Which type of school did you attend for the most time between the ages of 11 and 16?": "Rhowch werth ar gyfer Pa fath o ysgol wnaethoch chi fynychu fwyaf rhwng 11 ac 16 oed?",
  "A state-run or state-funded school – non-selective": "Ysgol yn cael ei rhedeg neu ei hariannu gan y wladwriaeth - nad yw’n ddewisol",
  "A state-run or state-funded school – selective": "Ysgol yn cael ei rhedeg neu ei hariannu gan y wladwriaeth - dewisol",
  "Independent or fee-paying school": "Ysgol annibynnol neu ysgol lle telir ffi",
  "Independent or fee-paying school, where I received a bursary covering 90% or more of my tuition": "Ysgol annibynnol neu ysgol lle telir ffi, a chefais fwrsari a oedd yn talu am 90% neu fwy o fy addysg",
  "Attended school outside the UK": "Mynychu ysgol y tu allan i’r DU",
  "I don't know": "Nid wyf yn gwybod",
  "Did either of your parents attend university and gain a degree (e.g. BA/BSc or equivalent) by the time you were 18?": "A wnaeth unrhyw un o’ch rhieni fynychu prifysgol a chael gradd (e.e. BA/BSc neu gyfwerth) erbyn pan oeddech yn 18oed?",
  "Please enter a value for Did either of your parents attend university and gain a degree (e.g. BA/BSc or equivalent) by the time you were 18?": "Rhowch werth ar gyfer A wnaeth unrhyw un o’ch rhieni fynychu prifysgol a chael gradd (e.e. BA/BSc neu gyfwerth) erbyn pan oeddech yn 18oed?",
  "No, neither of my parents attended university": "Na, ni wnaeth yr un o’m rhieni fynychu prifysgol",
  "Yes, one or both of my parents attended university": "Do mi wnaeth un neu ddau o’m rhieni fynychu prifysgol",
  "Do not know / not sure": "Nid wyf yn gwybod / Nid wyf yn siŵr",
  "Please rank the locations in which you would like to work": "Rhowch y llefydd ble byddech yn hoffi gweithio yn eu trefn",
  "Bristol": "Bryste",
  "Cardiff": "Caerdydd",
  "Northumbria and North Durham (Newcastle)": "Northumbria a Gogledd Durham (Newcastle)",
  "Wolverhampton and Telford": "Wolverhampton a Telford",
  "Do you currently have a s.9(1) authorisation?": "A oes gennych chi awdurdodiad a.9(1) ar hyn o bryd?",
  "Can you work for at least 3 years before reaching the retirement age of 75?": "Allwch chi weithio am o leiaf 3 blynedd cyn cyrraedd yr oed ymddeol o 75?",
  "Candidates for posts in Wales need to have an understanding, or the ability to acquire the understanding, of the administration of justice in Wales, including legislation applicable to Wales and Welsh devolution arrangements.": "Bydd yn rhaid i ymgeiswyr am swyddi yng Nghymru feddu ar ddealltwriaeth o sut gweinyddir cyfiawnder yng Nghymru, gan gynnwys deddfwriaeth sy’n berthnasol i Gymru a threfniadau datganoli yng Nghymru, neu’r gallu i feithrin y ddealltwriaeth hon.",
  "Please indicate, in order of preference, all the regions you are willing to work in. All assignments are subject to business needs.": "Nodwch, yn nhrefn eich dewis, yr holl ranbarthau rydych yn barod i weithio ynddynt. Mae pob penodiad yn dibynnu ar anghenion y busnes.",
  "London/South Eastern": "Llundain/De Ddwyrain Lloegr",
  "North Eastern": "Gogledd Ddwyrain Lloegr",
  "Northern": "Gogledd",
  "Western": "Gorllewin",
  "Wales": "Cymru",
  "Please specify in which jurisdiction(s) you predominantly work. Mae’r information provided will have no bearing on our selection process but may be of assistance i the Senior Presiding Judge when successful candidates are deployed i their base court.": "Nodwch ym mha awdurdodaeth(au) rydych chi’n gweithio’n bennaf. Ni fydd yr wybodaeth a ddarperir yn effeithio o gwbl ar ein proses ddethol ond gall fod o gymorth i’r Uwch Farnwr Llywyddol pan fydd ymgeiswyr llwyddiannus yn cael eu neilltuo i’w llys sylfaenol.",
  "Civil": "Sifil",
  "Family": "Teulu",
  "Civil and Family": "Sifil a Theulu",
  "Secondment to the Court of Protection": "Secondiad i’r Llys Gwarchod",
  "Some District Judges are also nominated i sit as judges of the Court of Protection either in Llundain or in the regions. It is expected that there will be a requirement of three posts specifically from this recruitment exercise for full-time secondment i the Court of Protection in London. Please indicate whether you would like i be considered for the Court of Protection.": "Mae rhai Barnwyr Rhanbarth yn cael eu henwebu i eistedd fel barnwyr yn y Llys Gwarchod naill ai yn Llundain neu yn y rhanbarthau. Disgwylir y bydd gofyniad am dair swydd yn benodol o’r ymarfer recriwtio hwn ar gyfer secondiad amser llawn i’r Llys Gwarchod yn Llundain. Nodwch a hoffech gael eich ystyried ar gyfer y Llys Gwarchod.",
  "Posts in Wales - Welsh Language": "Swyddi yng Nghymru - Cymraeg",
  "Do you wish i be considered for a Welsh speaking post? (Welsh language is not essential for any of the vacancies, and as such will not form part of your assessment).": "Ydych chi’n dymuno cael eich ystyried ar gyfer swydd Gymraeg? (Nid yw’r Gymraeg yn hanfodol ar gyfer unrhyw un o’r swyddi gwag, ac oherwydd hynny, ni fydd yn rhan o’ch asesiad).",
  "Yes, I can also confirm I can speak in Welsh": "Ydw, gallaf hefyd gadarnhau fy mod yn gallu siarad Cymraeg",
  "Not Applicable": "Amherthnasol",
  "Posts in Wales - Welsh Language Continued": "Swyddi yng Nghymru - Cymraeg Parhad",
  "If you wish to be considered for a Welsh speaking post, can you read and write in Welsh? (Reading and writing in Welsh is not essential for any of the vacancies, and as such will not form part of your assessment).": "Os ydych chi’n dymuno cael eich ystyried ar gyfer swydd Gymraeg, ydych chi’n gallu darllen ac ysgrifennu yn Gymraeg? (Nid yw’r gallu i ddarllen ac ysgrifennu yn Gymraeg yn hanfodol ar gyfer unrhyw un o’r swyddi gwag, ac oherwydd hynny, ni fydd yn rhan o’ch asesiad).",
  "Select all that apply": "Dewiswch bob un sy'n berthnasol",
  "Occupation of main household earner": "Galwedigaeth prif enillydd y cartref",
  "Type of school attended": "Math o ysgol a fynychwyd",
  "Either parent attended university to gain a degree": "A wnaeth y naill riant neu'r llall fynychu’r brifysgol i ennill gradd",
  "You might not meet the nationality requirement": "Efallai na fyddwch yn bodloni'r gofyniad cenedligrwydd",
  "Based on your answer, it looks like you do not meet the nationality requirement for the role. You can continue to apply, but it might be unlikely that you will be offered a position.": "Yn seiliedig ar eich ateb, mae'n ymddangos nad ydych yn bodloni'r gofyniad cenedligrwydd ar gyfer y rôl. Gallwch barhau i wneud cais, ond gallai fod yn annhebygol y byddwch yn cael cynnig y swydd.",
  "Back to JAC homepage": "Yn ôl i dudalen gartref y JAC",
  "Continue to apply": "Parhau i wneud cais",
  "Back to top": "Yn ôl i frig y dudalen",
  "Part-time working is available in principle to all salaried judicial office holders, with some exceptions, unless the relevant senior judicial office holder consider that the request is incompatible with the business need. The complete Judicial Salaried Part-time Working Policy is available on the judicial intranet. A salaried part-time judicial office holder is subject to the same terms and conditions as a full-time judicial office holder. For example, they are required to give up legal practice on appointment and is subject to the same requirements concerning conduct. A salaried part-time judicial office holder is also entitled to the same benefits as the full-time judiciary such as a pension and paid leave (albeit calculated on a pro-rata basis) and sick leave. A salaried part-time Judge will be expected to sit for the full duration in longer cases.": "Mae gweithio rhan-amser ar gael mewn egwyddor i bob deiliad swydd farnwrol cyflogedig, gyda rhai eithriadau, oni bai bod yr uwch ddeiliad swydd farnwrol perthnasol yn ystyried bod y cais yn anghydnaws â’r angen busnes. Mae'r Polisi Gwaith Rhan-amser Cyflogedig Barnwrol cyflawn ar gael ar y fewnrwyd farnwrol. Mae deiliad swydd farnwrol ran-amser cyflogedig yn ddarostyngedig i’r un telerau ac amodau â deiliad swydd farnwrol amser llawn. Er enghraifft, mae'n ofynnol iddynt roi'r gorau i ymarfer cyfreithiol adeg eu penodi ac mae'n ddarostyngedig i'r un gofynion o ran ymddygiad. Mae gan ddeiliad swydd farnwrol ran-amser cyflogedig hefyd hawl i’r un buddion â’r farnwriaeth amser llawn megis pensiwn ac absenoldeb â thâl (er ei fod yn cael ei gyfrifo ar sail pro-rata) ac absenoldeb salwch. Bydd disgwyl i Farnwr rhan-amser cyflogedig eistedd am y cyfnod llawn mewn achosion hirach.",
  "Do you want to apply for the President role, the Deputy role or both?": "Ydych chi am wneud cais am rôl y Llywydd, rôl y Dirprwy Lywydd neu'r ddau?",
  "President of Adjudication Panel for Wales": "Llywydd Panel Dyfarnu Cymru",
  "Deputy President of Adjudication Panel for Wales": "Dirprwy Lywydd Panel Dyfarnu Cymru",
  "Both roles": "Y ddwy rôl",
  "Overview of the role": "Trosolwg o’r swydd",
  "Number of vacancies:": "Nifer y swyddi gwag:",
  "Salary/Fee:": "Cyflog/Ffi:",
  "Contact:": "Cyswllt:",
  "Relevant information (downloads):": "Gwybodaeth berthnasol (lawrlwytho):",
  "Timeline": "Amserlen",
  "Open for applications": "Agor ar gyfer ceisiadau",
  "Closed for applications": "Cau ar gyfer ceisiadau",
  "Location:": "Lleoliad:",
  "About the role": "Am y swydd",
  "President and Deputy President of Adjudication Panel for Wales": "Llywydd a Dirprwy Lywydd Panel Dyfarnu Cymru",
  "JAC00192 President and Deputy President of Adjudication Panel for Wales": "JAC00192 Llywydd a Dirprwy Lywydd Panel Dyfarnu Cymru",
  "28 September 2023": "28 Medi 2023",
  "12 October 2023": "12 Hydref 2023",
  "Tribunal hearings are conducted across all regions of Wales, candidates must be available to undertake the office of the President or Deputy President on the business of the Tribunal travelling independently throughout Wales and be able to stay overnight where necessary. However, a large proportion of the President’s and Deputy President’s work can be done remotely.": "Cynhelir gwrandawiadau tribiwnlys ar draws pob rhanbarth yng Nghymru, ac mae’n rhaid i ymgeiswyr fod ar gael i ymgymryd â swydd y Llywydd neu’r Dirprwy Lywydd ar fusnes y Tribiwnlys, gan deithio’n annibynnol ledled Cymru a gallu aros dros nos lle bo angen. Fodd bynnag, gellir gwneud cyfran fawr o waith y Llywydd a’r Dirprwy Lywydd o bell.",
  "Commissioner conflicts": "Gwrthdaro buddiannau",
  "Members of the Judicial Appointments Commission (JAC) come from a wide background to ensure the Commission has a breadth of knowledge, expertise and independence.": "Mae Aelodau’r Comisiwn Penodiadau Barnwrol (JAC) yn dod o amrywiaeth eang o gefndiroedd i sicrhau bod gan y Comisiwn wybodaeth, profiad ac annibyniaeth eang.",
  "Are you related to, or known to any of the JAC Commissioners? If you are in any doubt then please select 'Yes' in the list below:": "Ydych chi’n perthyn i unrhyw un o Gomisiynwyr y JAC neu a ydynt yn gwybod pwy ydych chi? Os oes gennych unrhyw amheuon dewiswch ‘Ydw’ yn y rhestr isod:",
  "Please provide details of your relationship.": "Rhowch fanylion eich perthynas.",
  "I do not have a pre-existing relationship with any of the commissioners": "Nid oes gennyf unrhyw fath o berthynas ag unrhyw un o’r comisiynwyr",
  "Post qualification experience": "Profiad ar ôl cymhwyso",
  "Career history - post qualification experience": "Hanes gyrfa - profiad ar ôl gymhwyso",
  "Starting with your most recent appointment and working back, provide details of your career to date, including all judicial and quasi-judicial appointments and any gaps in employment.": "Gan ddechrau gyda’ch penodiad diweddaraf a gweithio’n ôl, rhowch fanylion eich gyrfa hyd yma, gan gynnwys pob penodiad barnwrol a lled-farnwrol ac unrhyw fylchau mewn cyflogaeth.",
  "Ongoing": "Parhaus",
  "Judicial role sitting days": "Diwrnodau eistedd mewn rôl farnwrol",
  "days": "diwrnod",
  "Edit": "Golygu",
  "Is this an appointment or a gap in employment?": "A yw hwn yn benodiad neu’n fwlch mewn cyflogaeth?",
  "It is an appointment.": "Mae’n benodiad.",
  "It is a gap in employment.": "Mae’n fwlch mewn cyflogaeth.",
  "or": "neu",
  "Tick if still ongoing": "Ticiwch os yw’n dal i barhau",
  "Save": "Cadw",
  "Is this a judicial or quasi-judicial post?": "A yw hon yn swydd farnwrol neu led-farnwrol?",
  "Please enter a value for Is this a judicial or quasi-judicial post?": "Rhowch werth ar gyfer y A yw hon yn swydd farnwrol neu led-farnwrol",
  "Quasi-judicial refers to a role similar to that of a judge, such as the chair of an equivalent body for which a legal qualification is required. An equivalent body is one of a quasi-judicial nature for which the powers and procedures should resemble those of a court of law and involve highly complex matters, requiring its members objectively to determine the facts and draw conclusions to reach a reasoned decision. Such decisions could result in the imposition of a penalty, and they are likely to affect the legal rights, duties or privileges of specific parties. Examples could include, but are not restricted to, disciplinary tribunals and conduct hearings for professional standards bodies, the parole board, arbitration and chairs of statutory inquiries.": "Mae lled-farnwrol yn golygu rôl debyg i rôl barnwr, fel cadeirydd corff cyfatebol y mae angen cymhwyster cyfreithiol ar ei gyfer. Mae corff cyfatebol yn un lled-farnwrol, sydd â phwerau a gweithdrefnau tebyg i bwerau llys barn ac sy'n ymwneud â materion cymhleth iawn, sy’n golygu ei fod yn ofynnol i'w aelodau benderfynu’n wrthrychol ar y ffeithiau a dod i gasgliadau er mwyn dod i benderfyniad rhesymegol. Gallai penderfyniadau o'r fath arwain at orfodi cosb, ac maent yn debygol o effeithio ar hawliau, dyletswyddau neu freintiau cyfreithiol partïon penodol. Gallai enghreifftiau gynnwys tribiwnlysoedd disgyblu a gwrandawiadau ymddygiad ar gyfer cyrff safonau proffesiynol, y bwrdd parôl, cyflafareddu a chadeiryddion ymchwiliadau statudol ond nid yw’r rhestr hon yn cynnwys popeth.",
  "Judicial": "Barnwrol",
  "Quasi-judicial": "Lled-farnwrol",
  "How many sitting days have you accumulated in this post?": "Sawl diwrnod eistedd ydych chi wedi’u cronni yn y swydd hon?",
  "Please enter a value for How many sitting days have you accumulated in this post?": "Rhowch werth ar gyfer y Sawl diwrnod eistedd ydych chi wedi’u cronni yn y swydd hon",
  "Is a legal qualification a requisite for appointment?": "A yw cymhwyster cyfreithiol yn angenrheidiol ar gyfer y penodiad?",
  "Only numerical digits can be input into the sitting days field. If the number of days is 100 or more, an approximate figure will suffice.": "Dim ond cyfanrifau positif gellir eu rhoi yn y maes diwrnodau eistedd. Os yw’r nifer o ddiwrnodau’n 100 neu’n fwy, bydd ffigur bras yn ddigon.",
  "Please enter a value for Is a legal qualification a requisite for appointment?": "Rhowch werth ar gyfer y A yw cymhwyster cyfreithiol yn angenrheidiol ar gyfer y penodiad",
  "Please outline the powers, procedures and main responsibilities": "Amlinellwch y pwerau, y gweithdrefnau a’r prif gyfrifoldebau",
  "Gap in Employment": "Bwlch mewn Cyflogaeth",
  "You have indicated that you have": "Rydych wedi nodi bod gennych gyfanswm o",
  "sitting days in total.": "diwrnod eistedd.",
  "As you have indicated you have less than": "Gan eich bod wedi nodi bod gennych lai na",
  "sitting days across all judicial and/or quasi-judicial appointments, please provide details of how you have acquired the necessary skills for this role in some other significant way.": "o ddiwrnodau eistedd ar draws pob penodiad barnwrol a/neu led-farnwrol, rhowch fanylion am sut rydych wedi ennill y sgiliau angenrheidiol ar gyfer y rôl hon mewn rhyw ffordd arwyddocaol arall."
}
